---
kind: property
id: P:Autodesk.Revit.DB.DefinitionBindingMap.IsEmpty
source: html/69282b6f-8d03-09f7-353d-deed41ab4ba6.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.IsEmpty Property

Test to see if the map is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the map is empty then True will be returned, otherwise False.